In [9]:
#create a database name “Pusername_dCenter” in MySQL provided by our university (URL: "myeusql.dur.ac.uk") (assume that the username is "dur" and password is "G5k/709”) [10 marks]

import mysql.connector
from mysql.connector import Error

try:
    connection = mysql.connector.connect(user='cwrk44', password='byke57r', host= 'myeusql.dur.ac.uk')
    #mySql_Create_Database = CREATE DATABASE NewDatabase;
    if connection.is_connected():
        db.Info = connection.get_server_info()
        print('Connected to MySQL Server version ', db_Info)
        cursor = connection.cursor()
        cursor.execute('SHOW DATABASES')
        records = cursor.fetchall()
        for record in records:
            print(record)   

except Error as e:
    print('Error while connecting to MySQL', e)

Error while connecting to MySQL 2005 (HY000): Unknown MySQL server host 'myeusql.dur.ac.uk' (11001)

In [3]:
#b)	create the tables designed in your ER diagram in this database.  Lecture 7 page 15

#teacher table
mySql_Create_Table_Teacher_Query = """CREATE TABLE teacher ( 
teacher_id int(10) NOT NULL, 
t_fullname varchar(200) NOT NULL,
t_address varchar(200) NOT NULL,
t_phonenumber int(11) NOT NULL,
t_email varchar(100) NOT NULL , 
hiring_date Date NOT NULL, 
salary float(12) NOT NULL,
contract_id int(11) NOT NULL,
PRIMARY KEY (teacher_id)),
FOREIGN KEY (contract_id) REFERENCES contract(contract_id)
)
"""

#contract table
mySql_Create_Table_Contract_Query = """CREATE TABLE contract ( 
contract_id int(10) NOT NULL, 
teacher_id int(10) NOT NULL,
course_id VARCHAR(10) NOT NULL,
PRIMARY KEY (contract_id)),
FOREIGN KEY (teacher_id) REFERENCES teacher(teacher_id),
FOREIGN KEY (course_id) REFERENCES course(course_id)
)
"""

#course table
mySql_Create_Table_Course_Query = """CREATE TABLE course ( 
course_id VARCHAR(10) NOT NULL,
title VARCHAR(50) NOT NULL,
language VARCHAR(10) NOT NULL,
course_type VARCHAR(10) NOT NULL,
precessor_course_id VARCHAR(10) NOT NULL,
successor_course_id VARCHAR(10) NOT NULL,
contract_id int(10) NOT NULL,
reg_id int(10) NOT NULL,
PRIMARY KEY (course_id)),
FOREIGN KEY (contract_id) REFERENCES contract(contract_id),
FOREIGN KEY (reg_id) REFERENCES registration(reg_id)
)
"""

#registration table
mySql_Create_Table_Registration_Query = """CREATE TABLE registration ( 
reg_id int(10) NOT NULL, 
course_id VARCHAR(10) NOT NULL,
student_id int(8) NOT NULL,
PRIMARY KEY (reg_id)),
FOREIGN KEY (course_id) REFERENCES course(course_id)
FOREIGN KEY (student_id) REFERENCES student(student_id),
)
"""


#student table
mySql_Create_Table_Student_Query = """CREATE TABLE student ( 
student_id int(8) NOT NULL, 
s_fullname varchar(200) NOT NULL,
s_address varchar(200) NOT NULL,
s_phonenumber int(11) NOT NULL,
s_email varchar(100) NOT NULL , 
date_of_join Date NOT NULL,
reg_id int(10) NOT NULL,
PRIMARY KEY (student_id),
FOREIGN KEY (reg_id) REFERENCES registration(reg_id)
) 
"""

In [4]:
#insert at least two rows in each table. – Lecture 7 page 20-25